Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The just released Quarkus 1.10.2.Final comes with a lot of improvements and new features:
ja_jp: リリースされたばかりのQuarkus 1.10.2.Finalには、多くの改善と新機能が搭載されています。

source: The kafka username (the client id from the service account)
ja_jp: kafka ユーザー名 (サービスアカウントのクライアント ID)

source: The kernel modifications above also apply to Linux virtual machines. If running on a bare metal Linux machine, tweaking only `perf_event_paranoid` is enough.
ja_jp: 上記のカーネルの変更は、Linux 仮想マシンにも適用されます。ベアメタル Linux マシンで実行している場合は、 `perf_event_paranoid` を微調整するだけで十分です。

source: The key and value object can be any of Enum, Scalar or Complex object
ja_jp: キーと値のオブジェクトは、 Enum 、 Scalar 、 Complex のいずれかを指定します。

source: The key combines `String` dayOfWeek, `int` dayOfMonth and `String` city. The associated value is of type `String`.
ja_jp: キーは、 `String` dayOfWeek、 `int` dayOfMonth、および `String` city を組み合わせたものです。関連付けられている値は `String` 型です。

source: The key combines a `java.util.LocalDate` date and a `String` city. The associated value is of type 'String'.
ja_jp: キーは、 `java.util.LocalDate` の日付と `String` city を組み合わせたものです。関連付けられた値は 'String' 型です。

source: The key file
ja_jp: キーファイル

source: The key id
ja_jp: キー ID

source: The key is a `String`. The associated value is of type `org.acme.ExpensiveResponse`.
ja_jp: キーは `String` です。関連付けられている値は `org.acme.ExpensiveResponse` 型です。

source: The key method is `.serviceConfig(myConfig)`. The current config is compared reflectively to the config of running services each restart.
ja_jp: 主要なメソッドは `.serviceConfig(myConfig)` です。現在の設定は、再起動ごとに実行中のサービスの設定とリフレクションによって比較されます。

source: The key password
ja_jp: キーパスワード

source: The key points are:
ja_jp: 主なポイント:

source: The key store file
ja_jp: キーストアファイル

source: The key takeaway point here is the following: Keeping optional features, particularly those that depend on third party libraries or API subsystems with a big footprint, in separate modules is the best solution.
ja_jp: ここで重要なポイントは次のとおりです。オプションの機能、特に大きなフットプリントを持つサードパーティーのライブラリーや API サブシステムに依存する機能は、別のモジュールに保持することが最善のソリューションです。

source: The key that will be used as the Redis key
ja_jp: Redisキーとして使用されるキー

source: The key will be scoped automatically, so you do not have to prefix any namespace. Later we will discuss how to access this data in the webcomponent (page).
ja_jp: キーは自動的にスコープ設定されるため、名前空間をプレフィックスとして付ける必要はありません。このデータを Web コンポーネント (ページ) でアクセスする方法については後で説明します。

source: The keyring name
ja_jp: キーリング名

source: The keys can also be loaded by the code that builds the token, and then supplied to JWT Build API for token creation.
ja_jp: キーは、トークンを構築するコードによって読み込まれ、トークン作成のために JWT ビルド API に渡すこともできます。

source: The keys can also be loaded by the code which builds the token and supplied to JWT Build API.
ja_jp: キーは、JWT ビルド API に提供される、トークンをビルドするコードによってロードすることもできます。

source: The keystore where the server's private key is located.
ja_jp: サーバーの秘密鍵が保存されているキーストア。

source: The label `app-with-metrics` will be used in a later step to select the applications to monitor by OpenShift.
ja_jp: ラベル `app-with-metrics` は、後のステップで OpenShift が監視するアプリケーションを選択するために使用されます。

source: The label is what will be displayed in the action drop down in thw Workspace Page
ja_jp: ラベルは、ワークスペースページのドロップダウンアクションに表示されるものです

source: The labels in generated resources will look like:
ja_jp: 生成されたリソースのラベルは次のようになります:

source: The lack of JMX support is a natural consequence of running in native mode and is unlikely to be resolved.
ja_jp: JMXのサポートがないのは、ネイティブモードで実行することの当然の結果であり、解決される見込みはありません。

source: The lambda can also be invoked locally with the SAM CLI like this:
ja_jp: Lambda は、以下のようにSAM CLI によってローカルで呼び出すこともできます。

source: The lambda will be called for every text message sent from the server.
ja_jp: lambda は、サーバーから送信されるテキストメッセージごとに呼び出されます。

source: The land page is served by a JAX-RS Resource and shows information obtained from the OpenID Provider about the authenticated user and the current tenant.
ja_jp: ランディングページはJAX-RSリソースによって提供され、認証されたユーザーと現在のテナントに関するOpenIDプロバイダから取得した情報を表示します。

source: The last bit of the application's code is the configuration of the `movies-from-kafka` channel in `application.properties`:
ja_jp: アプリケーションのコードの最後のビットは、`application.properties` の `movies-from-kafka` チャネルの設定です。

source: The last extension is the reactive database driver for PostgreSQL. Hibernate Reactive uses that driver to interact with the database without blocking the caller thread.
ja_jp: 最後のエクステンションは、PostgreSQL用のリアクティブデータベースドライバです。Hibernate Reactiveはこのドライバを使用して、呼び出し元のスレッドをブロックすることなくデータベースと対話します。

source: The last important point is to make sure the callback path you enter in the GitHub OAuth application configuration matches the endpoint path where you'd like the user be redirected to after a successful GitHub authentication and application authorization, in this case it has to be set to `http:localhost:8080/github/userinfo`.
ja_jp: 最後の重要なポイントは、GitHub OAuth アプリケーション設定に入力するコールバックパスが、GitHub 認証とアプリケーション承認が成功した後にユーザーをリダイレクトするエンドポイントパスと一致することを確認することです。この場合は、 `http:localhost:8080/github/userinfo` に設定する必要があります。

source: The last interesting observation we made was that the results for `plain Java 180 Mb` were nearly identical to `Quarkus jvm 180 Mb`. This meant that the cost of the applicative framework, which provides maintainability and productivity, was 0 in our case. It's like having your cake and eating it as well. In our case we did not mind slow executions, as long as we could save a lot on memory and CPU, which we were able to achieve.
ja_jp: 最後に興味深い観察結果として、 `plain Java 180 Mb` の結果が `Quarkus jvm 180 Mb` とほぼ同じだったことが挙げられます。これは、保守性と生産性を提供するアプリケーションフレームワークのコストが、私たちのケースでは0だったということです。ケーキを食べているようなものですね。私たちの場合、メモリとCPUを大幅に節約できるのであれば、実行速度が遅くても構わないと考えていましたが、それが実現できました。

source: The last missing piece is the REST API that will expose GET and POST methods:
ja_jp: 最後に必要なのは、GETとPOSTのメソッドを公開するREST APIです。

source: The last option is to the use the link:https://kotlinlang.org/docs/reference/compiler-plugins.html#no-arg-compiler-plugin[no-arg] compiler plugin. This plugin is configured with a list of annotations, and the end result is the generation of no-args constructor for each class annotated with them.
ja_jp: 最後の方法は、 link:https://kotlinlang.org/docs/reference/compiler-plugins.html#no-arg-compiler-plugin[no-arg]compiler plugin を使うことです。このプラグインにはアノテーションのリストが設定されており、最終的にはアノテーションが設定されている各クラスのno-argsコンストラクタが生成されます。

source: The last point is probably most important, because this is how application entry points are made unremovable. A good example is a JAX-RS resource class, identified by the RESTEasy extension. Another example is a bean which declares a `@Scheduled` method, identified by the Scheduler extension.
ja_jp: 最後の点が最も重要であると思われます。なぜならば、これはアプリケーションのエントリーポイントが削除できないようにする方法だからです。例えば、RESTEasyエクステンションで識別されるJAX-RSリソースクラスが良い例です。もう1つの例は、 `@Scheduled` メソッドを宣言しているBeanで、Schedulerエクステンションによって識別されます。

source: The last section use the _imperative_ mailer. Quarkus also offers a reactive API.
ja_jp: 最後のセクションでは、 _命令型_ のメーラーを使用しています。QuarkusはリアクティブなAPIも提供しています。

source: The last thing to do is to provide a `org.infinispan.protostream.MessageMarshaller` implementation for each user class defined in the proto schema. This class is then provided via `@Produces` in a similar fashion to the code based proto schema definition above.
ja_jp: 最後にすべきことは、proto スキーマで定義された各ユーザクラスの `org.infinispan.protostream.MessageMarshaller` 実装を提供することです。このクラスは、上記のコードベースの proto スキーマの定義と同様の方法で `@Produces` を介して提供されます。

source: The latest compatible version of the `quarkus-prettytime` extension
ja_jp: `quarkus-prettytime` エクステンションの最新の互換性のあるバージョン

source: The latest curated online stories, articles, and videos in and around Quarkus.
ja_jp: Quarkusとその周辺に関する最新のオンラインストーリー、記事、ビデオなどをキュレーションしてお届けします。

source: The lead architect responsible for prototyping says:
ja_jp: プロトタイピングを担当するリードアーキテクトは次のように言います:

source: The lead developer on the Technical Steering Committee responsible for the upkeep of the API explains:
ja_jp: APIの説明を維持するための技術運営委員会の主任開発者は次のように説明しています:

source: The learning curve was too steep
ja_jp: 学習曲線が急すぎる

source: The legacy OpenTracing framework has been deprecated in favor of the new OpenTelemetry tracing framework. We announced the https://quarkus.io/blog/quarkus-observability-roadmap-2023/#opentracing-archived[OpenTracing deprecation on November 2022], and we are dropping the extension from Quarkus core repository and moving it to the Quarkiverse Hub.
ja_jp: レガシーの OpenTracing フレームワークは非推奨となり、新しい OpenTelemetry トレーシングフレームワークが採用されました。 https://quarkus.io/blog/quarkus-observability-roadmap-2023/#opentracing-archived[OpenTracing の非推奨化を 2022 年 11 月] に発表し、Quarkus コアリポジトリーからエクステンションを削除して、Quarkiverse Hub に移行しました。

source: The legacy OpenTracing tracer, must be replaced by the new OpenTelemetry tracer.
ja_jp: レガシーの OpenTracing トレーサーは、新しい OpenTelemetry トレーシングに置き換える必要があります。

source: The legacy `quarkus.package.jar.appcds.enabled` configuration is still supported but deprecated. Use `quarkus.package.jar.aot.enabled=true` with `quarkus.package.jar.aot.type=app-cds` instead.
ja_jp: レガシーな `quarkus.package.jar.appcds.enabled` 設定は引き続きサポートされますが、非推奨です。代わりに `quarkus.package.jar.aot.enabled=true` と `quarkus.package.jar.aot.type=app-cds` を使用してください。

source: The legacy client
ja_jp: レガシークライアント

source: The legacy configurations are now deprecated but will still work during a transition period.
ja_jp: レガシー設定は現在非推奨となっていますが、移行期間中は引き続き使用できます。

source: The legacy extension is removed from the project:
ja_jp: レガシーエクステンションがプロジェクトから削除されます。

source: The less easy way is to inject a `UserTransaction` and use the various transaction demarcation methods.
ja_jp: あまり簡単ではない方法としては、 `UserTransaction` を注入し、様々なトランザクション・デマケーションのメソッドを使用します。

source: The level to use to configure the category named `<category-name>`. The quotes are necessary.
ja_jp: `<category-name>` という名前のカテゴリを設定するために使用するレベル。クオートが必要です。

source: The link:++https://vertx.io/docs/vertx-core/java/#event_bus++[Vert.x Event Bus] uses link:++https://vertx.io/docs/vertx-core/java/#_message_codecs++[codecs] to _serialize_ and _deserialize_ message objects. Quarkus provides a default codec for local delivery. This codec is automatically used for return types and message body parameters of local consumers, i.e. methods annotated with `@ConsumeEvent` where `ConsumeEvent#local() == true` (which is the default).
ja_jp: link:++https://vertx.io/docs/vertx-core/java/#event_bus++[Vert.x イベントバス] は、link:++https://vertx.io/docs/vertx-core/java/#_message_codecs++[コーデック] を使用して、メッセージオブジェクトを _シリアライズ_ および _デシリアライズ_ します。Quarkus は、ローカル配信用のデフォルトのコーデックを提供します。このコーデックは、ローカルコンシューマーの戻り値の型とメッセージ本文パラメーター、つまり `@ConsumeEvent` アノテーションが付けられ、`ConsumeEvent#local() == true` （デフォルト）であるメソッドに自動的に使用されます。

source: The link:http://mongodb.github.io/mongo-java-driver/3.12/bson/pojos[POJO Codec] provides a set of annotations that enable the customization of the way a POJO is mapped to a MongoDB collection and this codec is initialized automatically by Quarkus
ja_jp: link:http://mongodb.github.io/mongo-java-driver/3.12/bson/pojos[POJO Codec] は、POJOをMongoDBコレクションにマッピングする方法をカスタマイズできるアノテーションのセットを提供しています。このCodecはQuarkusによって自動的に初期化されます。

source: The link:https://datatracker.ietf.org/doc/html/rfc9396#name-common-data-fields[common data field] `locations` is added as an array of strings.
ja_jp: link:https://datatracker.ietf.org/doc/html/rfc9396#name-common-data-fields[共通データフィールド] `locations` は、文字列の配列として追加されます。

source: The link:https://datatracker.ietf.org/doc/html/rfc9396[OAuth 2.0 Rich Authorization Requests] (RAR) specification allows OAuth2 client applications to specify fine-grained authorization requirements in the authorization code flow request. Instead of relying solely on traditional OAuth 2.0 scopes, RAR allows the representing of required permissions as a JSON object that must be URL-encoded and passed as an `authorization_details` query parameter.
ja_jp: link:https://datatracker.ietf.org/doc/html/rfc9396[OAuth 2.0 リッチ認可リクエスト] (RAR) 仕様は、OAuth2 クライアントアプリケーションが認可コードフローリクエストできめ細かな認可要件を指定できるようにします。 従来の OAuth 2.0 スコープのみに頼るのではなく、RAR は必要な権限を URL エンコードして `authorization_details` クエリーパラメーターとして渡す必要のある JSON オブジェクトとして表現できるようにします。

source: The link:https://datatracker.ietf.org/doc/html/rfc9396[OAuth 2.0 Rich Authorization Requests] (RAR) specification enables OAuth2 client applications to specify fine-grained authorization requirements during the authorization code flow. Instead of relying solely on traditional OAuth 2.0 scopes, RAR represents required permissions as JSON that is URL-encoded and passed as an `authorization_details` query parameter.
ja_jp: link:https://datatracker.ietf.org/doc/html/rfc9396[OAuth 2.0 リッチ認可リクエスト] (RAR) 仕様により、OAuth2 クライアントアプリケーションは、認可コードフロー中にきめ細かな認可要件を指定できるようになります。従来の OAuth 2.0 スコープのみに頼る代わりに、RAR は必要な権限を JSON として表現し、URL エンコードして `authorization_details` クエリーパラメーターとして渡します。

source: The link:https://docs.hibernate.org/orm/{hibernate-orm-version-major-minor}/querylanguage/html_single/[Hibernate Query Language] (HQL), which is the query language used by Hibernate, supported by the `@HQL` annotation.
ja_jp: link:https://docs.hibernate.org/orm/{hibernate-orm-version-major-minor}/querylanguage/html_single/[Hibernate Query Language] (HQL) は、Hibernate で使用されるクエリ言語であり、`@HQL` アノテーションによってサポートされます。

source: The link:https://github.com/quarkusio/quarkus/blob/main/CONTRIBUTING.md#documentation[Documentation] section of the Quarkus "Contributing" guide.
ja_jp: Quarkus "貢献" ガイドの https://github.com/quarkusio/quarkus/blob/main/CONTRIBUTING.md#documentation[ドキュメント] セクション。

source: The link:https://github.com/redhat-developer/service-binding-operator[Service Binding Operator] is an Operator that implements link:https://github.com/k8s-service-bindings/spec[Service Binding Specification for Kubernetes] and is meant to simplify the binding of services to an application. Containerized applications that support link:https://github.com/k8s-service-bindings/spec#workload-projection[Workload Projection] obtain service binding information in the form of volume mounts. The Service Binding Operator reads binding service information and mounts it to the application containers that need it.
ja_jp: link:https://github.com/redhat-developer/service-binding-operator[Service Binding Operator] は、link:https://github.com/k8s-service-bindings/spec[Service Binding Specification for Kubernetes] を実装する Operator で、アプリケーションへのサービスのバインディングを簡素化するためのものです。link:https://github.com/k8s-service-bindings/spec#workload-projection[Workload Projection] をサポートするコンテナー型アプリケーションは、サービスバインディング情報をボリュームマウントの形で取得します。Service Binding Operator は、バインディングサービス情報を読み取り、それを必要とするアプリケーションコンテナーにマウントします。

source: The link:https://github.com/redhat-developer/service-binding-operator[Service Binding Operator] is an Operator that implements link:https://github.com/servicebinding/spec[Service Binding Specification for Kubernetes] and is meant to simplify the binding of services to an application. Containerized applications that support link:https://github.com/servicebinding/spec#workload-projection[Workload Projection] obtain service binding information in the form of volume mounts. The Service Binding Operator reads binding service information and mounts it to the application containers that need it.
ja_jp: link:https://github.com/redhat-developer/service-binding-operator[Service Binding Operator] は、link:https://github.com/k8s-service-bindings/spec[Service Binding Specification for Kubernetes] を実装する Operator で、アプリケーションへのサービスのバインディングを簡素化するためのものです。link:https://github.com/servicebinding/spec#workload-projection[Workload Projection] をサポートするコンテナー型アプリケーションは、サービスバインディング情報をボリュームマウントの形で取得します。Service Binding Operator は、バインディングサービス情報を読み取り、それを必要とするアプリケーションコンテナーにマウントします。

source: The link:https://quarkus.io/blog/path-resolution-in-quarkus/[Path Resolution in Quarkus] blog post further explains how path resolution works for both user and extension defined paths.
ja_jp: link:https://quarkus.io/blog/path-resolution-in-quarkus/[Quarkus のパス解決]に関するブログ記事では、ユーザー定義パスとエクステンション定義パスの両方に対するパス解決の仕組みについて詳しく説明しています。

source: The link:https://quarkus.io/guides/[Quarkus documentation] menu page, also known as the doc index page, is sourced in the link:https://github.com/quarkusio/quarkusio.github.io[quarkusio.github.io] repository.
ja_jp: link:https://quarkus.io/guides/[Quarkusのドキュメント] メニューページは、doc indexページとも呼ばれ、 link:https://github.com/quarkusio/quarkusio.github.io[quarkusio.github.io] リポジトリにソースがあります。

source: The link:https://smallrye.io/docs/smallrye-fault-tolerance/5.5.0/usage/programmatic-api.html[programmatic API] is present, including Mutiny support, and integrated with the declarative, annotation-based API. You can use the `FaultTolerance` and `MutinyFaultTolerance` APIs out of the box.
ja_jp: Mutinyのサポートを含む link:https://smallrye.io/docs/smallrye-fault-tolerance/5.3.1/usage/programmatic-api.html[プログラム的なAPI] が存在し、宣言的でアノテーションベースのAPIと統合されています。デフォルトで `FaultTolerance` と `MutinyFaultTolerance` の API を使うことができます。

source: The link:https://smallrye.io/docs/smallrye-fault-tolerance/6.10.0/reference/programmatic-api.html[programmatic API] is present and integrated with the declarative, annotation-based API. You can use the `Guard`, `TypedGuard` and `@ApplyGuard` APIs out of the box.
ja_jp: link:https://smallrye.io/docs/smallrye-fault-tolerance/6.10.0/reference/programmatic-api.html[プログラムAPI] が存在し、宣言的なアノテーションベースのAPIと統合されています。 `Guard`、 `TypedGuard`、および `@ApplyGuard` のAPIをすぐに使用できます。

source: The link:https://smallrye.io/docs/smallrye-fault-tolerance/6.2.6/reference/programmatic-api.html[programmatic API] is present, including Mutiny support, and integrated with the declarative, annotation-based API. You can use the `FaultTolerance` and `MutinyFaultTolerance` APIs out of the box.
ja_jp: Mutinyのサポートを含む link:https://smallrye.io/docs/smallrye-fault-tolerance/6.2.6/reference/programmatic-api.html[プログラムAPI] が存在し、宣言的なアノテーションベースのAPIと統合されています。 `FaultTolerance` および `MutinyFaultTolerance` API はすぐに使用できます。

source: The link:https://tools.ietf.org/html/rfc7519[JWT specification] defines various levels of security of JWTs that one can use. The {mp-jwt} specification requires JWTs signed with the RSA-256 signature algorithm. This in turn requires an RSA public key pair. On the REST endpoint server side, you need to configure the location of the RSA public key to use to verify the JWT sent along with requests. The `mp.jwt.verify.publickey.location=publicKey.pem` setting configured previously expects that the public key is available on the classpath as `publicKey.pem`. To accomplish this, copy the following content to a `security-jwt-quickstart/src/main/resources/publicKey.pem` file.
ja_jp: link:https://tools.ietf.org/html/rfc7519[JWT 仕様] では、使用できる JWT のさまざまなセキュリティーレベルが定義されています。 {mp-jwt} 仕様では、RSA-256 署名アルゴリズムで署名された JWT が必要です。 これには、RSA 公開鍵ペアが必要になります。 REST エンドポイントサーバー側では、リクエストとともに送信された JWT を検証するために使用する RSA 公開鍵の場所を設定する必要があります。 以前に設定された `mp.jwt.verify.publickey.location=publicKey.pem` 設定では、公開鍵がクラスパス上で `publicKey.pem` として使用可能であることが想定されています。 これを実現するには、次のコンテンツを `security-jwt-quickstart/src/main/resources/publicKey.pem` ファイルにコピーします。

source: The link:https://www.mongodb.com/docs/drivers/java/sync/current/fundamentals/data-formats/document-data-format-pojo/[POJO Codec] provides a set of annotations that enable the customization of the way a POJO is mapped to a MongoDB collection and this codec is initialized automatically by Quarkus
ja_jp: link:http://mongodb.github.io/mongo-java-driver/3.12/bson/pojos[POJO codec] は、POJOをMongoDBコレクションにマッピングする方法をカスタマイズできるアノテーションのセットを提供しています。このCodecはQuarkusによって自動的に初期化されます。

source: The link:https://www.mongodb.com/docs/drivers/java/sync/current/fundamentals/data-formats/document-data-format-pojo/[POJO Codec] provides a set of annotations that enable the customization of the way a POJO is mapped to a MongoDB collection and this codec is initialized automatically by Quarkus. This codec also supports Java records so you can use them for your POJOs or an attribute of your POJOs.
ja_jp: link:https://www.mongodb.com/docs/drivers/java/sync/current/fundamentals/data-formats/document-data-format-pojo/[POJO Codec] は、POJO を MongoDB コレクションにマッピングする方法をカスタマイズできる一連のアノテーションを提供します。このコーデックは Quarkus によって自動的に初期化されます。 このコーデックは Java レコードもサポートしているため、POJO または POJO の属性に使用できます。

source: The link:mallocstacks.py[mallocstacks.py] bcc/eBPF script will be used to capture the `malloc` stacktraces with their allocated size. This script, and other typical bcc/eBPF scripts (e.g. `stackcount`), need to be given a process ID (PID). This makes a bit tricky when you want to trace startup, but you can use `gdb` (even if you haven't enabled debug info) to get around this obstacle because it allows you to stop the application at the first instruction. Let's start by running the native executable via `gdb`:
ja_jp: mallocstacks.py bcc/eBPF スクリプトは、 `malloc` スタックトレースをその割り当てられたサイズとともにキャプチャするために使用されます。このスクリプトや他の典型的な bcc/eBPF スクリプト (例えば `stackcount` ) には、プロセス ID (PID) を与える必要があります。このため、起動をトレースしたい場合は少し厄介ですが、 `gdb` (デバッグ情報を有効にしていなくても) を使用すると、最初の命令でアプリケーションを停止できるため、この問題を回避することが可能です。まず、 `gdb` を使ってネイティブ実行可能ファイルを実行してみましょう:

source: The link:{jakarta-data-spec-url}#_jakarta_data_query_language[Jakarta Data Query Language] (JD-QL), which is a subset of the Jakarta Persistence Query Language, supported by the `@Query` annotation.
ja_jp: link:{jakarta-data-spec-url}#_jakarta_data_query_language[Jakarta Data Query Language] (JD-QL) は、Jakarta Persistence Query Language のサブセットであり、`@Query` アノテーションによってサポートされます。

source: The link:{jakarta-persistence-spec-url}#a4665[Jakarta Persistence Query Language] (JP-QL), which is a subset of the Hibernate Query Language. It is currently being moved to its own spec called link:https://jakarta.ee/specifications/query/1.0/jakarta-query-1.0-m1[Jakarta Query].
ja_jp: link:{jakarta-persistence-spec-url}#a4665[Jakarta Persistence Query Language] (JP-QL) は、Hibernate Query Language のサブセットです。これは現在、link:https://jakarta.ee/specifications/query/1.0/jakarta-query-1.0-m1[Jakarta Query] と呼ばれる独自の仕様に移行中です。

source: The link:{jaxrsapi}/jakarta/ws/rs/core/MediaType.html[`MediaType`] class has many constants you can use to point to specific pre-defined media types.
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/core/MediaType.html[`MediaType`] クラスには多くの定数があり、 特定の定義済みメディアタイプを指すために使用できます。

source: The link:{jaxrsapi}/javax/ws/rs/core/MediaType.html[`MediaType`] class has many constants you can use to point to specific pre-defined media types.
ja_jp: link:{jaxrsapi}/javax/ws/rs/core/MediaType.html[`MediaType`] クラスには、特定の事前定義されたメディアタイプを指すために使用できる多くの定数があります。

source: The link:{jdkapi}/java/util/concurrent/CompletionStage.html[`CompletionStage`] return type is also supported.
ja_jp: link:{jdkapi}/java/util/concurrent/CompletionStage.html[`CompletionStage`] 戻り値の型もサポートされています。

source: The link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`] annotation is optional: any parameter whose name matches an existing URI template variable will be automatically assumed to have link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`].
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`] アノテーションはオプションです。名前が既存のURIテンプレート変数と一致するパラメータは、自動的に link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`] があると想定されます。
